Hi @ewbankkit 

I haven't worked out a minimal configuration, but from looking at the example provided at https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/ecs_task_definition and removing extra stuff, I get something like this:

```
resource "aws_ecs_task_definition" "service" {
  family = "service"
  container_definitions = jsonencode([
    {
      name      = "first"
      image     = "service-first"
      cpu       = 10
      memory    = 512
      essential = true
      portMappings = [
        {}
      ]
    }
  ])
}
```

The key part here is that the `portMappings` contains an empty list with just an empty object.

The `terraform plan` for this looks like this:

```
  # aws_ecs_task_definition.service will be created
  + resource "aws_ecs_task_definition" "service" {
      + arn                   = (known after apply)
      + arn_without_revision  = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + cpu          = 10
                  + essential    = true
                  + image        = "service-first"
                  + memory       = 512
                  + name         = "first"
                  + portMappings = [
                      + {
                          + appProtocol = ""
                          + protocol    = ""
                        },
                    ]
                },
            ]
        )
      + family                = "service"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + skip_destroy          = false
      + tags_all              = {
          + "agathos.audit"       = "2023-01-18"
          + "agathos.environment" = "dev"
          + "agathos.stack"       = "agathos-redash"
          + "agathos.terraform"   = "1"
        }
      + track_latest          = false
    }
```

Notice the inserted `appProtocol` and `protocol` in the portMappings.

